Stupid-Git/Cyclone-Lin/Cyclone_Open_2_4_4/third_party/nxp/devices/mimxrt1189/drivers/fsl_flexspi_flr.h
/*
 * Copyright 2023 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef __FSL_FLEXSPI_FOLLOWER_H_
#define __FSL_FLEXSPI_FOLLOWER_H_

#include <stddef.h>
#include "fsl_device_registers.h"
#include "fsl_common.h"

/*!
 * @addtogroup flexspi_flr
 * @{
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @name Driver version */
/*@{*/
/*! @brief FLEXSPI FOLLOWER driver version. */
#define FSL_FLEXSPI_SLV_DRIVER_VERSION (MAKE_VERSION(1, 0, 0))
/*@}*/

#define FSL_FEATURE_FLEXSPI_SLV_AXI_RX_BUFFER_SIZE (2*1024)
#define FSL_FEATURE_FLEXSPI_SLV_AXI_TX_BUFFER_SIZE (1024)

#define FLEXSPI_SLV_MAILBOX_CMD(x)     ((x) & 0xFFFFFFFE)
#define FLEXSPI_SLV_MAILBOX_CMD_INT(x) ((x) | 0x1)

#define FLEXSPI_SLV_CMD_DDR(x)         (((x) << 8) | (x))

/*! @brief IO mode enumeration of FLEXSPI FOLLOWER.*/
enum
{
    kFLEXSPI_SLV_IOMODE_SDRx4 = 0,
    kFLEXSPI_SLV_IOMODE_SDRx8 = 1,
    kFLEXSPI_SLV_IOMODE_DDRx4 = 2,
    kFLEXSPI_SLV_IOMODE_DDRx8 = 3
};

/*! @brief Clock frequency enumeration of FLEXSPI FOLLOWER.*/
enum
{
    RootClock_50M   = 50,
    RootClock_66M   = 66,
    RootClock_80M   = 80,
    RootClock_100M  = 100,
    RootClock_133M  = 133,
    RootClock_166M  = 166,
    RootClock_200M  = 200,
    RootClock_400M  = 400,
};

/*! @brief The read fetch size enumeration of FLEXSPI FOLLOWER.*/
enum
{
    Read_Fetch_256Bytes   = 0,
    Read_Fetch_512Bytes   = 1,
    Read_Fetch_1KBytes    = 2,
    Read_Fetch_2KBytes    = 3
};

/*! @brief Clock frequency enumeration of FLEXSPI FOLLOWER.*/
enum
{
    Write_Watermark_32Bytes   = 0,
    Write_Watermark_64Bytes   = 1,
    Write_Watermark_128Bytes  = 2,
    Write_Watermark_256Bytes  = 3
};

/*! @brief Interrupt status flags of FLEXSPI FOLLOWER.*/
enum
{
    kFLEXSPI_SLV_Mail0InterruptFlag   = 0, /*!< Mailbox0 interrupt */
    kFLEXSPI_SLV_Mail1InterruptFlag   = 1, /*!< Mailbox1 interrupt */
    kFLEXSPI_SLV_Mail2InterruptFlag   = 2, /*!< Mailbox2 interrupt */
    kFLEXSPI_SLV_Mail3InterruptFlag   = 3, /*!< Mailbox3 interrupt */
    kFLEXSPI_SLV_Mail4InterruptFlag   = 4, /*!< Mailbox4 interrupt */
    kFLEXSPI_SLV_Mail5InterruptFlag   = 5, /*!< Mailbox5 interrupt */
    kFLEXSPI_SLV_Mail6InterruptFlag   = 6, /*!< Mailbox6 interrupt */
    kFLEXSPI_SLV_Mail7InterruptFlag   = 7, /*!< Mailbox7 interrupt */
    kFLEXSPI_SLV_Mail8InterruptFlag   = 8, /*!< Mailbox8 interrupt */
    kFLEXSPI_SLV_WriteOverflowFlag    = 9, /*!< An IO RX FIFO overflow occurred during
                                                command/address/write data phase */
    kFLEXSPI_SLV_ReadUnderflowFlag    = 10, /*!< IO TX FIFO underflow has occurred
                                                 during a read command */
    kFLEXSPI_SLV_ErrorCommandFlag     = 11, /*!< An unknown command has been received
                                                 from the SPI bus */
    kFLEXSPI_SLV_InvalidInterruptFlag = 12,
};

/*! @brief FLEXSPI FOLLOWER configuration structure. */
typedef struct _flexspi_slv_config
{
    int         clock_freq;
    uint32_t    baseAddr1;    /*!< Read/Write CMD1 Base Address. */
    uint32_t    baseAddr2;    /*!< Read/Write CMD2 Base Address. */
    uint32_t    addrRange1;   /*!< Read/Write CMD1 Addr Range. */
    uint32_t    addrRange2;   /*!< Read/Write CMD2 Addr Range. */
    uint8_t     io_mode;      /*!< IO mode control - SDRx4, SDRx8, DDRx4, DDRx8*/
    uint8_t     rxFetch_size; /*!< Specifies the maximum read size triggered by a single read command. */
    uint8_t     rxWatermark;  /*!< Triggers a new AXI read to fetch more data through the IP AXI header. */
    uint8_t     txWatermark;  /*!< Specifies the watermark value. During the write command, if pending
                                write data equals or exceeds the watermark level, it triggers a new AXI write. */
} flexspi_slv_config_t;

/* Forward declaration of the handle typedef. */
typedef struct _flexspi_slv_handle flexspi_slv_handle_t;

/*! @brief FLEXSPI FOLLOWER interrupt callback function. */
typedef void (*flexspi_slv_interrupt_callback_t)(FLEXSPI_SLV_Type *base,
                                            flexspi_slv_handle_t *handle);

/*! @brief Interrupt handle structure for FLEXSPI FOLLOWER. */
struct _flexspi_slv_handle
{
    uint32_t state;                            /*!< Interrupt state for FLEXSPI FOLLOWER */
    flexspi_slv_interrupt_callback_t callback; /*!< Callback for users while mailbox received or error occurred */
    void *userData;                            /*!< FLEXSPI FOLLOWER callback function parameter.*/
};

/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif /*_cplusplus. */

/*!
 * @name Initialization and deinitialization
 * @{
 */

/*!
 * @brief Get the instance number for FLEXSPI FOLLOWER.
 *
 * @param base FLEXSPI FOLLOWER base pointer.
 */
uint32_t FLEXSPI_SLV_GetInstance(FLEXSPI_SLV_Type *base);

/*!
 * @brief Check and clear interrupt flags.
 *
 * @param base FLEXSPI FOLLOWER base pointer.
 * @return Interrupt flag.
 */
uint32_t FLEXSPI_SLV_CheckAndClearInterrupt(FLEXSPI_SLV_Type *base);

/*!
 * @brief Initializes the FLEXSPI FOLLOWER module and internal state.
 *
 * This function enables the clock for FLEXSPI FOLLOWER and also configures the FLEXSPI FOLLOWER
 * with the input configure parameters. Users should call this function before any FLEXSPI
 * FOLLOWER operations.
 *
 * @param base FLEXSPI FOLLOWER peripheral base address.
 * @param config FLEXSPI FOLLOWER configure structure.
 */
void FLEXSPI_SLV_Init(FLEXSPI_SLV_Type *base, const flexspi_slv_config_t *config);

/*!
 * @brief Gets default settings for FLEXSPI FOLLOWER.
 *
 * @param config FLEXSPI FOLLOWER configuration structure.
 */
void FLEXSPI_SLV_GetDefaultConfig(flexspi_slv_config_t *config);

/*!
 * @brief Deinitializes the FLEXSPI FOLLOWER module.
 *
 * Clears the FLEXSPI FOLLOWER state and FLEXSPI FOLLOWER module registers.
 * @param base FLEXSPI FOLLOWER peripheral base address.
 */
void FLEXSPI_SLV_Deinit(FLEXSPI_SLV_Type *base);

/*!
 * @brief Software reset for the FLEXSPI FOLLOWER logic.
 *
 * This function sets the software reset flags for the FLEXSPI FOLLOWER.
 *
 * @param base FLEXSPI FOLLOWER peripheral base address.
 * @param val 0(Finished) or 1(Initiate)
 */
static inline void FLEXSPI_SLV_SoftwareReset_SetVal(FLEXSPI_SLV_Type *base, uint32_t val)
{
    base->MODULE_CONTROL &= ~FLEXSPI_SLV_MODULE_CONTROL_SWRESET_MASK;
    base->MODULE_CONTROL |= FLEXSPI_SLV_MODULE_CONTROL_SWRESET(val);
}

/*!
 * @brief Set IO mode for the FLEXSPI FOLLOWER module.
 *
 * This function sets the IO mode flags for the FLEXSPI FOLLOWER.
 *
 * @param base FLEXSPI FOLLOWER peripheral base address.
 * @param val Set IO Mode for FLEXSPI FOLLOWER
 */
static inline void FLEXSPI_SLV_IOMode_SetVal(FLEXSPI_SLV_Type *base, uint32_t val)
{
    base->MODULE_CONTROL &= ~FLEXSPI_SLV_MODULE_CONTROL_IOMODE_MASK;
    base->MODULE_CONTROL |= FLEXSPI_SLV_MODULE_CONTROL_IOMODE(val);
}

/*!
 * @brief Update RW CMD base address and range value for the FLEXSPI FOLLOWER module.
 *
 * This function updates RW CMD base address and range value for the FLEXSPI FOLLOWER.
 *
 * @param base FLEXSPI FOLLOWER peripheral base address.
 */
static inline void FLEXSPI_SLV_Update_RWCMD_Base_Range(FLEXSPI_SLV_Type *base)
{
    base->MODULE_CONTROL |= FLEXSPI_SLV_MODULE_CONTROL_CMDRANGEBASEUPDATE_MASK;
}

/*!
 * @brief Set RW command base address1 for the FLEXSPI FOLLOWER module.
 *
 * This function sets the RW command base address1 for the FLEXSPI FOLLOWER.
 *
 * @param base FLEXSPI FOLLOWER peripheral base address.
 * @param val The high 16-bit base address of the RW command
 */
static inline void FLEXSPI_SLV_RW_CMD_BaseAddr1_SetVal(FLEXSPI_SLV_Type *base, uint32_t val)
{
    base->RW_COMMAND_BASE &= ~FLEXSPI_SLV_RW_COMMAND_BASE_ADDRBASE1_MASK;
    base->RW_COMMAND_BASE |= FLEXSPI_SLV_RW_COMMAND_BASE_ADDRBASE1(val);
}

/*!
 * @brief Set RW command base address2 for the FLEXSPI FOLLOWER module.
 *
 * This function sets the RW command base address2 for the FLEXSPI FOLLOWER.
 *
 * @param base FLEXSPI FOLLOWER peripheral base address.
 * @param val The high 16-bit base address of the RW command
 */
static inline void FLEXSPI_SLV_RW_CMD_BaseAddr2_SetVal(FLEXSPI_SLV_Type *base, uint32_t val)
{
    base->RW_COMMAND_BASE &= ~FLEXSPI_SLV_RW_COMMAND_BASE_ADDRBASE2_MASK;
    base->RW_COMMAND_BASE |= FLEXSPI_SLV_RW_COMMAND_BASE_ADDRBASE2(val);
}

/*!
 * @brief Set address1/2 range for the FLEXSPI FOLLOWER module.
 *
 * This function sets the address1/2 range for the FLEXSPI FOLLOWER.
 *
 * @param base FLEXSPI FOLLOWER peripheral base address.
 * @param i The index of RW command, 0 or 1.
 * @param val The size of the memory range in 1KB units.
 */
static inline void FLEXSPI_SLV_AddrRange_SetVal(FLEXSPI_SLV_Type *base, uint32_t i, uint32_t val)
{
    base->CMD_RANGE[i] = FLEXSPI_SLV_CMD_RANGE_RANGE(val);
}

/*!
 * @brief Enable or disable read water mark  for the FLEXSPI FOLLOWER module.
 *
 * This function enables or disables read water mark for the FLEXSPI FOLLOWER.
 *
 * @param base FLEXSPI FOLLOWER peripheral base address.
 * @param val 0(Disable) or 1(Enable)
 */
static inline void FLEXSPI_SLV_Read_WMEN_SetVal(FLEXSPI_SLV_Type *base, uint32_t val)
{
    base->READ_COMMAND_CONTROL &= ~FLEXSPI_SLV_READ_COMMAND_CONTROL_WMEN_MASK;
    base->READ_COMMAND_CONTROL |= FLEXSPI_SLV_READ_COMMAND_CONTROL_WMEN(val);
}

/*!
 * @brief Set read water mark level for the FLEXSPI FOLLOWER module.
 *
 * This function sets read water mark level for the FLEXSPI FOLLOWER.
 *
 * @param base FLEXSPI FOLLOWER peripheral base address.
 * @param val Read watermark level in bytes
 */
static inline void FLEXSPI_SLV_Read_RDWM_SetVal(FLEXSPI_SLV_Type *base, uint32_t val)
{
    base->READ_COMMAND_CONTROL &= ~FLEXSPI_SLV_READ_COMMAND_CONTROL_RDWM_MASK;
    base->READ_COMMAND_CONTROL |= FLEXSPI_SLV_READ_COMMAND_CONTROL_RDWM(val);
}

/*!
 * @brief Sets the maximum read size triggered by a single read command.
 *
 * This function sets the maximum read size for the FLEXSPI FOLLOWER.
 *
 * @param base FLEXSPI FOLLOWER peripheral base address.
 * @param val The maximum read size
 */
static inline void FLEXSPI_SLV_Read_FetchSizeSet(FLEXSPI_SLV_Type *base, uint32_t val)
{
    base->READ_COMMAND_CONTROL &= ~FLEXSPI_SLV_READ_COMMAND_CONTROL_RDFETCHSIZE_MASK;
    base->READ_COMMAND_CONTROL |= FLEXSPI_SLV_READ_COMMAND_CONTROL_RDFETCHSIZE(val);
}

/*!
 * @brief Gets the maximum read size triggered by a single read command.
 *
 * This function gets the maximum read size for the FLEXSPI FOLLOWER.
 *
 * @param base FLEXSPI FOLLOWER peripheral base address.
 * @return The maximum read size 
 */
static inline uint32_t FLEXSPI_SLV_Read_FetchSizeGet(FLEXSPI_SLV_Type *base)
{
    uint32_t regBitVal = base->READ_COMMAND_CONTROL & FLEXSPI_SLV_READ_COMMAND_CONTROL_RDFETCHSIZE_MASK;

