Stupid-Git/Cyclone-Lin/Cyclone_Open_2_4_4/third_party/nxp/devices/mimxrt1189/drivers/fsl_flexspi_flr.h
    return (regBitVal >> FLEXSPI_SLV_READ_COMMAND_CONTROL_RDFETCHSIZE_SHIFT);
}

/*!
 * @brief Set write water mark level for the FLEXSPI FOLLOWER module.
 *
 * This function sets write water mark level for the FLEXSPI FOLLOWER.
 *
 * @param base FLEXSPI FOLLOWER peripheral base address.
 * @param val Write watermark level
 */
static inline void FLEXSPI_SLV_Write_WRWM_SetVal(FLEXSPI_SLV_Type *base, uint32_t val)
{
    base->WRITE_COMMAND_CONTROL &= ~FLEXSPI_SLV_WRITE_COMMAND_CONTROL_WRWM_MASK;
    base->WRITE_COMMAND_CONTROL |= FLEXSPI_SLV_WRITE_COMMAND_CONTROL_WRWM(val);
}

/*!
 * @brief Set CS mask value for the FLEXSPI FOLLOWER module.
 *
 * This function sets CS mask value for the FLEXSPI FOLLOWER.
 *
 * @param base FLEXSPI FOLLOWER peripheral base address.
 * @param val 0(Not masked) or 1(Masked)
 */
static inline void FLEXSPI_SLV_CSMASK_SetVal(FLEXSPI_SLV_Type *base, uint32_t val)
{
    base->MODULE_CONTROL &= ~FLEXSPI_SLV_MODULE_CONTROL_CSMASK_MASK;
    base->MODULE_CONTROL |= FLEXSPI_SLV_MODULE_CONTROL_CSMASK(val);
}
/* @} */

/*!
 * @name Interrupts
 * @{
 */
/*!
 * @brief Enables the FLEXSPI FOLLOWER interrupts.
 *
 * @param base FLEXSPI FOLLOWER peripheral base address.
 * @param mask FLEXSPI FOLLOWER interrupt source.
 */
static inline void FLEXSPI_SLV_EnableInterrupts(FLEXSPI_SLV_Type *base, uint32_t mask)
{
    base->MODULE_INTEN |= mask;
}

/*!
 * @brief Disable the FLEXSPI FOLLOWER interrupts.
 *
 * @param base FLEXSPI FOLLOWER peripheral base address.
 * @param mask FLEXSPI FOLLOWER interrupt source.
 */
static inline void FLEXSPI_SLV_DisableInterrupts(FLEXSPI_SLV_Type *base, uint32_t mask)
{
    base->MODULE_INTEN &= ~mask;
}

/*!
 * @brief Get the FLEXSPI FOLLOWER enabled interrupts.
 *
 * @param base FLEXSPI FOLLOWER peripheral base address.
 */
static inline uint32_t FLEXSPI_SLV_GetEnabledInterrupts(FLEXSPI_SLV_Type *base)
{
    return (base->MODULE_INTEN);
}

/*!
 * @brief Enable the FLEXSPI FOLLOWER mailbox interrupts.
 *
 * @param base FLEXSPI FOLLOWER peripheral base address.
 * @param enable Whether enable the mailbox interrupt.
 */
static inline void FLEXSPI_SLV_EnableMailInterrupt(FLEXSPI_SLV_Type *base, bool enable)
{
    base->SPI_MAIL_CTRL = FLEXSPI_SLV_SPI_MAIL_CTRL_SPIINTEN(enable ? 1 : 0);
}

/*!
 * @brief Return whether the FLEXSPI FOLLOWER enables the mailbox interrupt.
 *
 * @param base FLEXSPI FOLLOWER peripheral base address.
 */
static inline bool FLEXSPI_SLV_GetEnabledMailInterrupt(FLEXSPI_SLV_Type *base)
{
    return ((base->SPI_MAIL_CTRL & FLEXSPI_SLV_SPI_MAIL_CTRL_SPIINTEN_MASK) ? true : false);
}
/* @} */

/*!
 * @brief Gets the SPI leader read/write out-of-allowed-range count.
 *
 * @param base FLEXSPI FOLLOWER peripheral base address.
 * @param[out] rdCount Pointer through which the current number in the read out-of-allowed-range counter is returned.
 *      Pass NULL if this value is not required.
 * @param[out] wrCount Pointer through which the current number in the write out-of-allowed-range counter is returned
 *      Pass NULL if this value is not required.
 */
static inline void FLEXSPI_SLV_GetOutOfRangeCounts(FLEXSPI_SLV_Type *base, size_t *rdCount, size_t *wrCount)
{
    if (NULL != rdCount)
    {
        *rdCount = ((base->MODULE_STATUS) & FLEXSPI_SLV_MODULE_STATUS_RDOFR_MASK) >> FLEXSPI_SLV_MODULE_STATUS_RDOFR_SHIFT;
    }
    if (NULL != wrCount)
    {
        *wrCount = ((base->MODULE_STATUS) & FLEXSPI_SLV_MODULE_STATUS_WROFR_MASK) >> FLEXSPI_SLV_MODULE_STATUS_WROFR_SHIFT;
    }
}

/*!
 * @name Status
 * @{
 */
/*!
 * @brief Get the FLEXSPI FOLLOWER interrupt status flags.
 *
 * @param base FLEXSPI FOLLOWER peripheral base address.
 * @retval Interrupt status flag, use status flag to AND the bit mask could get the related status.
 */
static inline uint32_t FLEXSPI_SLV_GetInterruptStatusFlags(FLEXSPI_SLV_Type *base)
{
    return (base->MODULE_INT);
}

/*!
 * @brief Get the FLEXSPI FOLLOWER mailbox interrupt register.
 *
 * @param base FLEXSPI FOLLOWER peripheral base address.
 * @return Return the index of the FLEXSPI FOLLOWER mail interrupt register
 */
static inline uint32_t FLEXSPI_SLV_GetMailInterruptIndex(FLEXSPI_SLV_Type *base)
{
    uint32_t index;

    for (index = 0; index < FLEXSPI_SLV_SPIMAIL_COUNT; index++)
    {
        if (base->SPIMAIL[index] & 0x1U)
        {
            break;
        }
    }
    return index;
}

/*!
 * @brief Get the FLEXSPI FOLLOWER mailbox data.
 *
 * @param base FLEXSPI FOLLOWER peripheral base address.
 * @param index The index of the mail interrupt register
 * @return Return the FLEXSPI FOLLOWER mailbox data
 */
static inline uint32_t FLEXSPI_SLV_GetMailboxData(FLEXSPI_SLV_Type *base, uint32_t index)
{
    return ((index < FLEXSPI_SLV_SPIMAIL_COUNT) ? base->SPIMAIL[index] : 0U);
}

/*!
 * @brief Clear the FLEXSPI FOLLOWER interrupt status flags.
 *
 * @param base FLEXSPI FOLLOWER peripheral base address.
 * @param mask FLEXSPI FOLLOWER interrupt source.
 */
static inline void FLEXSPI_SLV_ClearInterruptStatusFlags(FLEXSPI_SLV_Type *base, uint32_t mask)
{
    base->MODULE_INT |= mask;
}

/*!
 * @brief Clear the FLEXSPI FOLLOWER mailbox interrupt flag.
 *
 * @param base FLEXSPI FOLLOWER peripheral base address.
 */
static inline void FLEXSPI_SLV_ClearMailInterruptFlag(FLEXSPI_SLV_Type *base)
{
    base->SPI_MAIL_CTRL |= FLEXSPI_SLV_SPI_MAIL_CTRL_CLRINT_MASK;
}

/*! @brief Returns whether the current AXI write leader is busy with a write command.
 *
 * @param base FLEXSPI FOLLOWER peripheral base address.
 * @retval true The current AXI write leader is busy.
 * @retval false The current AXI write leader is not busy.
 */
static inline bool FLEXSPI_SLV_GetAXIWriteBusyStatus(FLEXSPI_SLV_Type *base)
{
    return ((base->MODULE_STATUS & FLEXSPI_SLV_MODULE_STATUS_WIP_MASK) ? true : false);
}

/*! @brief Returns whether the AXI read leader is busy with a read request or else idle with no pending
 *         AXI read request.
 *
 * @param base FLEXSPI FOLLOWER peripheral base address.
 * @retval true The current AXI read leader is idle.
 * @retval false The current AXI read leader is busy.
 */
static inline bool FLEXSPI_SLV_GetAXIReadIdleStatus(FLEXSPI_SLV_Type *base)
{
    return ((base->MODULE_STATUS & FLEXSPI_SLV_MODULE_STATUS_AXIREADIDLE_MASK) ? true : false);
}

/*! @brief Returns whether the SPI to read/write register queue is idle.
 *
 * @param base FLEXSPI FOLLOWER peripheral base address.
 * @retval true The SPI to read/write register queue is idle.
 * @retval false The SPI to read/write register queue is busy.
 */
static inline bool FLEXSPI_SLV_GetRegReadWriteIdleStatus(FLEXSPI_SLV_Type *base)
{
    return ((base->MODULE_STATUS & FLEXSPI_SLV_MODULE_STATUS_REGRWIDLE_MASK) ? true : false);
}

/*! @brief Returns whether the SEQ control logic is idle or else busy with an ongoing SPI request.
 *
 * @param base FLEXSPI FOLLOWER peripheral base address.
 * @retval true The SEQ control logic is idle.
 * @retval false The SEQ control logic is busy.
 */
static inline bool FLEXSPI_SLV_GetSEQIdleStatus(FLEXSPI_SLV_Type *base)
{
    return ((base->MODULE_STATUS & FLEXSPI_SLV_MODULE_STATUS_SEQIDLE_MASK) ? true : false);
}

/*! @brief Returns whether the FLEXSPI FOLLOWER module is busy.
 *
 * @param base FLEXSPI FOLLOWER peripheral base address.
 * @retval true The SEQ control logic is busy.
 * @retval false The SEQ control logic is idle.
 */
static inline bool FLEXSPI_SLV_GetModuleBusyStatus(FLEXSPI_SLV_Type *base)
{
    uint32_t statusMasks = 0, idleFlags = 0;

