Stupid-Git/Cyclone-Lin/Cyclone_Open_2_4_4/third_party/nxp/devices/mimxrt1189/drivers/fsl_flexspi_flr.h
    statusMasks = FLEXSPI_SLV_MODULE_STATUS_WIP_MASK |
                  FLEXSPI_SLV_MODULE_STATUS_AXIREADIDLE_MASK |
                  FLEXSPI_SLV_MODULE_STATUS_REGRWIDLE_MASK |
                  FLEXSPI_SLV_MODULE_STATUS_SEQIDLE_MASK;

    idleFlags = FLEXSPI_SLV_MODULE_STATUS_WIP(0) |
                FLEXSPI_SLV_MODULE_STATUS_AXIREADIDLE(1) |
                FLEXSPI_SLV_MODULE_STATUS_REGRWIDLE(1) |
                FLEXSPI_SLV_MODULE_STATUS_SEQIDLE(1);

    return (((base->MODULE_STATUS & statusMasks) != idleFlags) ? true : false);
}
/*@}*/

/*!
 * @name Bus Operations
 * @{
 */

/*!
 * @brief Sets the read memory command.
 *
 * @param base FLEXSPI FOLLOWER peripheral base address
 * @param i The read command setting register index
 * @param val The read command value.
 */
static inline void FLEXSPI_SLV_Read_CommandSet(FLEXSPI_SLV_Type *base, uint32_t i, uint32_t val)
{
    base->READ_COMMAND[i] &= ~FLEXSPI_SLV_READ_COMMAND_COMMANDSET_MASK;
    base->READ_COMMAND[i] |= FLEXSPI_SLV_READ_COMMAND_COMMANDSET(val);
}

/*!
 * @brief Gets the read memory command.
 *
 * @param base FLEXSPI FOLLOWER peripheral base address
 * @param i The read command setting register index
 */
static inline uint32_t FLEXSPI_SLV_Read_CommandGet(FLEXSPI_SLV_Type *base, uint32_t i)
{
    uint32_t regBitVal = base->READ_COMMAND[i] & FLEXSPI_SLV_READ_COMMAND_COMMANDSET_MASK;

    return (regBitVal >> FLEXSPI_SLV_READ_COMMAND_COMMANDSET_SHIFT);
}

/*!
 * @brief Sets the dummy cycle for the read memory command.
 *
 * @param base FLEXSPI FOLLOWER peripheral base address
 * @param i The read command dummy cycle setting register index
 * @param val The dummy cycle value of the read command.
 */
static inline void FLEXSPI_SLV_Read_Command_DummyCyclesSet(FLEXSPI_SLV_Type *base, uint32_t i, uint32_t val)
{
    base->READ_COMMAND[i] &= ~FLEXSPI_SLV_READ_COMMAND_DUMMYCYCLES_MASK;
    base->READ_COMMAND[i] |= FLEXSPI_SLV_READ_COMMAND_DUMMYCYCLES(val);
}

/*!
 * @brief Gets the dummy cycle for the read memory command.
 *
 * @param base FLEXSPI FOLLOWER peripheral base address
 * @param i The read command dummy cycle setting register index
 */
static inline uint32_t FLEXSPI_SLV_Read_Command_DummyCyclesGet(FLEXSPI_SLV_Type *base, uint32_t i)
{
    uint32_t regBitVal = base->READ_COMMAND[i] & FLEXSPI_SLV_READ_COMMAND_DUMMYCYCLES_MASK;

    return (regBitVal >> FLEXSPI_SLV_READ_COMMAND_DUMMYCYCLES_SHIFT);
}

/*!
 * @brief Sets the write memory command.
 *
 * @param base FLEXSPI FOLLOWER peripheral base address
 * @param i The write command setting register index
 * @param val The write command value.
 */
static inline void FLEXSPI_SLV_Write_CommandSet(FLEXSPI_SLV_Type *base, uint32_t i, uint32_t val)
{
    base->WRITE_COMMAND[i] &= ~FLEXSPI_SLV_WRITE_COMMAND_COMMANDSET_MASK;
    base->WRITE_COMMAND[i] |= FLEXSPI_SLV_WRITE_COMMAND_COMMANDSET(val);
}

/*!
 * @brief Sets the read register command.
 *
 * @param base FLEXSPI FOLLOWER peripheral base address
 * @param val The read register command value.
 */
static inline void FLEXSPI_SLV_Read_Register_CommandSet(FLEXSPI_SLV_Type *base, uint32_t val)
{
    base->READ_REGISTER_COMMAND0 &= ~FLEXSPI_SLV_READ_REGISTER_COMMAND0_COMMANDSET_MASK;
    base->READ_REGISTER_COMMAND0 |= FLEXSPI_SLV_READ_REGISTER_COMMAND0_COMMANDSET(val);
}

/*!
 * @brief Sets the dummy cycle for the read register command.
 *
 * @param base FLEXSPI FOLLOWER peripheral base address
 * @param val The dummy cycle value of the read register command.
 */
static inline void FLEXSPI_SLV_Read_Register_Command_DummyCyclesSet(FLEXSPI_SLV_Type *base, uint32_t val)
{
    base->READ_REGISTER_COMMAND0 &= ~FLEXSPI_SLV_READ_REGISTER_COMMAND0_DUMMYCYCLES_MASK;
    base->READ_REGISTER_COMMAND0 |= FLEXSPI_SLV_READ_REGISTER_COMMAND0_DUMMYCYCLES(val);
}

/*!
 * @brief Sets the write register command.
 *
 * @param base FLEXSPI FOLLOWER peripheral base address
 * @param val The write register command value.
 */
static inline void FLEXSPI_SLV_Write_Register_CommandSet(FLEXSPI_SLV_Type *base, uint32_t val)
{
    base->WRITE_REGISTER_COMMAND0 &= ~FLEXSPI_SLV_WRITE_REGISTER_COMMAND0_COMMANDSET_MASK;
    base->WRITE_REGISTER_COMMAND0 |= FLEXSPI_SLV_WRITE_REGISTER_COMMAND0_COMMANDSET(val);
}

/*! @} */

/*!
 * @name Transactional
 * @{
 */

/*!
 * @brief Initializes the FLEXSPI FOLLOWER handle which is used in transactional functions.
 *
 * @param base FLEXSPI FOLLOWER peripheral base address.
 * @param handle Pointer to flexspi_slv_handle_t structure to store the interrupt state.
 * @param callback Pointer to user callback function.
 * @param userData User parameter passed to the callback function.
 */
void FLEXSPI_SLV_InterruptCreateHandle(FLEXSPI_SLV_Type *base,
                                       flexspi_slv_handle_t *handle,
                                       flexspi_slv_interrupt_callback_t callback,
                                       void *userData);

/*!
 * @brief Master interrupt handler.
 *
 * @param base FLEXSPI FOLLOWER peripheral base address.
 * @param handle Pointer to flexspi_slv_handle_t structure.
 */
void FLEXSPI_SLV_HandleIRQ(FLEXSPI_SLV_Type *base, flexspi_slv_handle_t *handle);
/*! @} */

#if defined(__cplusplus)
}
#endif /*_cplusplus. */
/*@}*/

#endif /* __FSL_FLEXSPI_FOLLOWER_H_ */

